# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [2]:
drinks = pd.read_csv(
    "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv",
    keep_default_na=False,
)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [22]:
display(
    drinks.groupby(by="continent")[["beer_servings"]]
    .mean()
    .sort_values(by="beer_servings", ascending=False)
)

           beer_servings
continent
EU            193.777778
SA            175.083333
NA            145.434783
OC             89.687500
AF             61.471698
AS             37.045455

### Step 5. For each continent print the statistics for wine consumption.

In [23]:
display(
    drinks.groupby(by="continent")["beer_servings"].agg(
        ["mean", "sum", "count", "min", "max"]
    )
)
display(drinks.groupby(by="continent")["beer_servings"].describe())

                 mean   sum  count  min  max
continent
AF          61.471698  3258     53    0  376
AS          37.045455  1630     44    0  247
EU         193.777778  8720     45    0  361
NA         145.434783  3345     23    1  285
OC          89.687500  1435     16    0  306
SA         175.083333  2101     12   93  333

           count        mean        std   min     25%    50%     75%    max
continent
AF          53.0   61.471698  80.557816   0.0   15.00   32.0   76.00  376.0
AS          44.0   37.045455  49.469725   0.0    4.25   17.5   60.50  247.0
EU          45.0  193.777778  99.631569   0.0  127.00  219.0  270.00  361.0
NA          23.0  145.434783  79.621163   1.0   80.00  143.0  198.00  285.0
OC          16.0   89.687500  96.641412   0.0   21.00   52.5  125.75  306.0
SA          12.0  175.083333  65.242845  93.0  129.50  162.5  198.00  333.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [24]:
drinks.groupby(by="continent")[
    ["beer_servings", "spirit_servings", "wine_servings"]
].mean()

drinks.groupby("continent").mean(numeric_only=True)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
NA,145.434783,165.739130,24.521739,5.995652
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [ ]:
drinks.groupby(by="continent")[
    ["beer_servings", "spirit_servings", "wine_servings"]
].median()

drinks.groupby("continent").median(numeric_only=True)

           beer_servings  spirit_servings  wine_servings
continent
AF                  32.0              3.0            2.0
AS                  17.5             16.0            1.0
EU                 219.0            122.0          128.0
NA                 143.0            137.0           11.0
OC                  52.5             37.0            8.5
SA                 162.5            108.5           12.0

### Step 8. Print the mean, min and max values for spirit consumption.

#### This time output a DataFrame

In [21]:
drinks.groupby(by="continent")[["spirit_servings"]].agg(["mean", "min", "max"])

          spirit_servings
                     mean min  max
continent
AF              16.339623   0  152
AS              60.840909   0  326
EU             132.555556   0  373
NA             165.739130  68  438
OC              58.437500   0  254
SA             114.750000  25  302